# 错误处理统一格式
error_codes = 
	# 系统模块
	100000: '操作成功'
	100001: '操作失败'
	100002: '没有操作权限'
	100009: '系统错误'
	100010: '字段不能为空'
	# member模块
	200000: '注册成功'
	200001: '两次密码不一致'
	200002: '用户已存在'
	200003: '用户名格式错误'
	200004: '密码长度应该在6-18位之间'
	200005: '用户不存在'
	200006: '密码验证失败'
	200007: '登录成功'
	200008: '此QQ号码已和其它账号绑定'
	200009: '此账号已绑定邮箱'
	200010: '此邮箱已注册，不可绑定'
	200011: 'TOKEN无效'
	200012: '邮箱格式错误'
	200013: '此账号已绑定一个QQ，不能再绑定'
	# 数据模型模块
	300000: '记录不存在'
	300001: '缩略图尺寸不存在'

module.exports = (error_code, error_msg, http_code)->
	error_code: error_code
	error_msg: error_msg || error_codes[error_code]
	http_code: http_code